export const class1 = {
  content: `# 한달만에 웹 페이지 만들기

# 📅 "한 달이면 충분해요!"
  🙋프론트엔드 개발자가 되고 싶나요?\n
  🙋같이 일하는 개발자가 답답해서 내가 직접 하고 싶나요?\n
  🙋한번쯤 배워보고 싶었는데 기간이 너무 오래 걸려 엄두가 나지 않았다고요?


✅**현업 개발자**와 함께 프로젝트 방식으로 웹 페이지를 만들어보세요!

# 🏄 "이 수업은 빠르고 재밌습니다."

웹 페이지를 만들 때 **꼭 필요한 지식**과 어떻게 응용 하는지를 **"알 때 까지"** 설명 해드려요.

현업에서 사용되는 디자인을 여러분이 직접 HTML과 CSS를 사용하여 "구현" 하는 것이 목표이며

매 수업마다 "완성된 결과물"을 위한 "작은 결과물"을 만들며 이해가 안되는 것은 될 때까지 **"피드백"**⚡을 드릴 거에요.

아래는 우리가 수업을 통해 만들어 볼 웹 페이지랍니다 👀


✅**수업 대상**

🙇개발을 공부하고자 준비하시는 분

🎨퍼블리싱을 하고 싶은 현직 디자이너

👨‍💻웹 개발을 하고 싶은 분

👩‍🎓'코딩 할 줄 아는' 000이 되고 싶은 모든 분

✅**커리큘럼**

- **웹 기초 지식**
    - 웹 사이트를 만들 때 필요한 지식
        - 도메인
            - 네이버를 볼 수 있는 이유
        - 호스팅
            - 워드프레스나 윅스로 홈 페이지를 만드려면 호스팅이 필요하다는데 이게 뭔가요?
        - 서버
            - 서버, 서버 말만 들었지 왜 필요한지 잘 모르겠어요.
        - 브라우저
            - 인터넷 할 때 쓰는거 아닌가요?
- **HTML**
    - HTML에서 꼭 필요한 것들
        - 태그의 개념
        - 글자 쓰기
        - 이미지 넣기
        - 버튼 넣기
        - CSS와 연동
- **CSS**
    - 글자를 꾸미는 법
    - 요소를 선택하는 법
    - 레이아웃을 만드는 법
- Sass
- 구글 검색하기

✅**이 수업을 듣고 나면**

🖼️내 포트폴리오 사이트를 직접 만들어 볼 수 있어요.

🤸워드프레스로 만든 홈페이지에서 레이아웃을 수정할 수 있어요.

👨‍💻웹 개발자가 되기 위한 기초를 닦을 수 있어요.

✔ **선생님 정보**

- 주식회사 데브하이 창립멤버
- 근무 관리 시스템 Selene 개발 (Vue.js)
- 4년간 10여개 이상의 웹, 앱 서비스 외주 개발(React, React Native)
    - 캠퍼스 큐레이션 앱 토스트 개발 (iOS / Android React Native)
    - PC방 자리 모니터링 앱: Watcher (iOS / Android React Native)
    - 소개팅 어플리케이션 (iOS / Android React Native)
    - 여행 웹 서비스: 트립 어바웃(React)
    - 광고 대행 서비스: Ladies(React)
    - 미용실 예약 서비스: 미용언니(iOS / Android React Native)

- 리뷰쉐어 (웹 프론트엔드 및 어플리케이션 개발) - (Angular.js, React, React-Native, Next.js)
- 주식회사 시냅스코퍼레이션 설립
- 교육 서비스 티라노 클래스 개발 (React, Next.js, Apollo)

✔ **선생님 소개**

안녕하세요! Ck입니다👋 

약 4년 전 개발자로 커리어를 시작하려고 할 당시, 무엇부터 시작해야 할 지 몰랐습니다.

처음에는 독학으로 책을 몇 권 사서 하다가 혼선이 와서 누군가 가르쳐 줬으면 좋겠다 싶었어요.

그래서 막연하게 컴퓨터 학원을 등록하여 HTML, CSS, JS를 이용한 웹 개발부터 배우기 시작했습니다.

제가 다닌 학원은 커리어 전환을 내세우며 비싼 수강료(약 450만원)을 받았는데, 커리큘럼이 끝날 당시 커리어 전환 및 구직에 성공하신 분은 저를 포함해서 **15명중 4명** 밖에 없었습니다.

개발자가 되기 위해서 큰 돈을 들인 것일 텐데 여전히 개발을 할 줄 모르는 분들이 많아 커리어 전환에 실패한 모습을 보고 교육 현실에 대해 많은 회의감이 들었어요.

저는 학원에 등록할 당시 남들보다 절대 뛰어나지 않았고, 수업중에는 잘 이해되던 것이 막상 개발하려면 뭐부터 해야 할지도 모르는 상태였어요.

그런 제가 어떻게 못하던 것을 할 수 있게 되었을까요?

저의 수업을 통해 여러분들이 못하던 것을 할 수 있도록 제 모든 **'노하우'**를 알려드릴게요!
`
}
